Importing an existing resource also yields a bizarre diff:

```text
  # cloudflare_record.mx["purelymail_mx"] must be replaced
-/+ resource "cloudflare_record" "mx" {
      + allow_overwrite = false
      ~ created_on      = "2024-07-25T21:17:30.106Z" -> (known after apply)
      ~ hostname        = "my.domain" -> (known after apply)
      ~ id              = "cut" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
      ~ modified_on     = "2024-07-25T21:17:30.106Z" -> (known after apply)
      ~ name            = "my.domain" -> "@" # forces replacement
      - priority        = 0 -> null
      ~ proxiable       = false -> (known after apply)
      - tags            = [] -> null
      ~ value           = "mailserver.purelymail.com" -> (known after apply)
        # (4 unchanged attributes hidden)

      + data {
          + content  = "mailserver.purelymail.com"
          + priority = 0
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```